# SQL en Python
<img src=".\img\image-4.png" alt="EDA Path"
    title="A typical EDA path" width="600" height="300" />
## Conectamos con la base de datos

### Documentación de la librería SQLite3 que vamos a utilizar:
https://docs.python.org/3/library/sqlite3.html

In [10]:
# Importamos librerias
import pandas as pd
import sqlite3

In [2]:
# Conectamos con la base de datos chinook.db
path = "chinook.db"
connection = sqlite3.connect(path)

# Obtenemos un cursor que utilizaremos para hacer las queries
curs = connection.cursor()

In [3]:
# Creamos una Query sencilla
query = """
SELECT *
FROM genres
"""

In [4]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
my_query = curs.execute(query)
my_query

In [5]:
my_query.fetchall()

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [11]:
# Tambien podemos obtener el mismo resultado directamente con pandas
def sql_query(query):
        curs.execute(query)
        datos_query = curs.fetchall()
        col_names = [description[0] for description in curs.description]
        return pd.DataFrame(datos_query, columns=col_names)
sql_query(query)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

In [12]:
pd.read_sql_query(query,connection)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

## Ya podemos comenzar con la práctica de chinook:
Antes de empezar a atacar una base de datos, tendremos que saber qué hay dentro, y para ello lo mejor es ver cómo es su **modelo de datos**

![imagen](./img/chinook_data_model.png)

### 1.	Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

In [16]:
query = """
SELECT*
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId
"""
pd.read_sql_query(query, connection)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

### 2.	Facturas de Clientes de Brasil

In [17]:

query = """
SELECT c.Firstname||" "||c.LastName as "Name", i.InvoiceID
FROM customers c
JOIN invoices_items i ON c.CustomerId = i.CustomerID
WHERE c.Country ="Brazil"
"""
pd.read_sql_query(query, connection)

               Name  InvoiceId
0    Luís Gonçalves         98
1    Luís Gonçalves        121
2    Luís Gonçalves        143
3    Luís Gonçalves        195
4    Luís Gonçalves        316
5    Luís Gonçalves        327
6    Luís Gonçalves        382
7   Eduardo Martins         25
8   Eduardo Martins        154
9   Eduardo Martins        177
10  Eduardo Martins        199
11  Eduardo Martins        251
12  Eduardo Martins        372
13  Eduardo Martins        383
14  Alexandre Rocha         57
15  Alexandre Rocha         68
16  Alexandre Rocha        123
17  Alexandre Rocha        252
18  Alexandre Rocha        275
19  Alexandre Rocha        297
20  Alexandre Rocha        349
21  Roberto Almeida         34
22  Roberto Almeida        155
23  Roberto Almeida        166
24  Roberto Almeida        221
25  Roberto Almeida        350
26  Roberto Almeida        373
27  Roberto Almeida        395
28   Fernanda Ramos         35
29   Fernanda Ramos         58
30   Fernanda Ramos         80
31   Fernanda Ramos        132
32   Fernanda Ramos        253
33   Fernanda Ramos        264
34   Fernanda Ramos        319

### 3.	Muestra cada factura asociada a cada agente de ventas con su nombre completo.

In [25]:
query="""
SELECT i.*, e.Firstname||" "|| e.LastName as "Full Name"
FROM employees e
JOIN customers c ON e.EmployeeID = c.SupportRepID
JOIN invoices i ON i.CustomerID = c.CustomerID
"""
pd.read_sql_query(query, connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Full Name
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98,Jane Peacock
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96,Jane Peacock
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94,Jane Peacock
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99,Jane Peacock
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98,Jane Peacock
...,...,...,...,...,...,...,...,...,...,...
407,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91,Steve Johnson
408,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98,Steve Johnson
409,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96,Steve Johnson
410,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94,Steve Johnson
411,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99,Steve Johnson

### 4.	Para cada factura muestra el nombre del cliente, el país, el nombre del agente y el total

In [39]:
query="""
SELECT i.invoiceId, c.Firstname||" "|| c.LastName as "Full_Name", c.Country, e.Firstname||" "|| e.LastName as "Full_Name_A", i.Total
FROM employees e
JOIN customers c ON e.EmployeeID = c.SupportRepID
JOIN invoices i ON i.CustomerID = c.CustomerID

"""
pd.read_sql_query(query, connection)

     InvoiceId        Full_Name Country   Full_Name_A  Total
0           98   Luís Gonçalves  Brazil  Jane Peacock   3.98
1          121   Luís Gonçalves  Brazil  Jane Peacock   3.96
2          143   Luís Gonçalves  Brazil  Jane Peacock   5.94
3          195   Luís Gonçalves  Brazil  Jane Peacock   0.99
4          316   Luís Gonçalves  Brazil  Jane Peacock   1.98
..         ...              ...     ...           ...    ...
407         45  Puja Srivastava   India  Jane Peacock   5.94
408         97  Puja Srivastava   India  Jane Peacock   1.99
409        218  Puja Srivastava   India  Jane Peacock   1.98
410        229  Puja Srivastava   India  Jane Peacock  13.86
411        284  Puja Srivastava   India  Jane Peacock   8.91

[412 rows x 5 columns]

### 5.	Muestra cada artículo de la factura con el nombre de la canción.

In [33]:
query="""
SELECT i.* ,t.Name as Nombre_cancion
FROM Invoices i
JOIN Invoice_items it ON i.InvoiceId = it.InvoiceId
JOIN tracks t ON it.TrackId = t.TrackId

"""
pd.read_sql_query(query, connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Nombre_cancion
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98,Balls to the Wall
1,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98,Restless and Wild
2,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96,Put The Finger On You
3,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96,Inject The Venom
4,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96,Evil Walks
...,...,...,...,...,...,...,...,...,...,...
2235,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86,Looking For Love
2236,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86,Sweet Lady Luck
2237,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86,Feirinha da Pavuna/Luz do Repente/Bagaço da La...
2238,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86,Samba pras moças
2239,412,58,2013-12-22 00:00:00,"12,Community Centre",Delhi,None,India,110017,1.99,Hot Girl

### 6.	Muestra todas las canciones con su nombre, formato, álbum y género.

In [40]:
query="""
SELECT t.Name, m.Name as Format, a.Title as Album, g.Name as Genre
FROM tracks t
JOIN genres g ON t.GenreId = g.GenreId
JOIN albums a ON t.AlbumID = a.AlbumId
JOIN media_types m ON t.MediaTypeId = m.MediaTypeId



"""
pd.read_sql_query(query, connection)

,Name,Format,Album,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

### 7.	Muestra cuántas canciones hay en cada playlist y el nombre de cada playlist.

In [ ]:
query="""
SELECT t.Name, p
FROM tracks t
JOIN playlist_tracks pt ON pt.TrackId = t.TrackId
JOIN playlists p ON p.PlaylistId = pt.PlaylistId

"""
pd.read_sql_query(query, connection)

### 8.	Muestra cuánto ha vendido cada empleado.

### 9.	¿Quién ha sido el agente de ventas que más ha vendido en 2009?

### 10.	¿Cuáles son los 3 grupos que más han vendido?

### 11. Muestra cuántas canciones de Rock hay en cada playlist

### 12. Muestra una tabla con todas canciones y su(s) Id de factura, hayan sido vendidas alguna vez o no.

### 13. ¿Cuántos artistas no tienen ningún album?

In [62]:
query="""
SELECT COUNT(*) as "Artists without album"
FROM artists at
LEFT JOIN albums al ON at.artistId = al.artistId
WHERE Title IS NULL
"""
pd.read_sql_query(query, connection)

   Artists without album
0                     71